# read database

In [2]:
import pandas as pd
import numpy as np
import pyodbc
import warnings
warnings.filterwarnings("ignore")

In [3]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server']

In [8]:
SERVER_NAME='DESKTOP-DSQG3O0\SQLEXPRESS'
DATABASE_NAME='dbMom'

In [13]:
conn = pyodbc.connect("""DRIVER={{SQL Server}}; 
                        Server={0}; 
                       Database={1};
                       Trusted_Connection=yes;""".format(SERVER_NAME,DATABASE_NAME)
                     )

In [14]:
df_admins=pd.read_sql('Select * from dbo.Admin',conn)

In [15]:
df_admins.head()

,ADMIN_ID,ADMIN_NAME,ADMIN_EMAIL,ADMIN_PASSWORD,ADMIN_CONTACT,ADMIN_ADDRESS,ADMIN_PROFILE
0,1,Ayesha,ayesha@gmail.com,123,3445,sialkot,pakistani
1,2,Ayesha,ayesha1@gmail.com,123,3445,sialkot,pakistani

In [16]:
df_brands=pd.read_sql('Select * from dbo.Brand',conn)

In [17]:
df_brands.head()

,BRAND_ID,BRAND_NAME,BRAND_TYPE,CORRESPOND_TITLE,CORRESPOND_NAME,BRAND_PHONE,BRAND_TEL,BRAND_ADDRESS,BRAND_LOGO,BRAND_EMAIL,BRAND_PASSWORD,BRAND_NTN
0,3,mothercare,Baby care Products,Manager,Ali Arslan,03124578561,055-56780,"Satellite Town ,Gujranwala",~/ProductPicture/abc.jpeg,mothercare@gmail.com,1234567.m,1237890
1,6,hello,Baby care Products,trtito,Ali Arslan,02563900249,styt7899,3556 New Creek Road,~/ProductPicture/6.png,mothercare@gmail.com,1234567.m,1237890